In [31]:
import numpy as np
import pandas as pd

In [32]:
mp=pd.read_csv('spam1.csv')
mp.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
3330,ham,How much it will cost approx . Per month.,NaN,NaN,NaN
1315,ham,"Whenevr ur sad, Whenevr ur gray, Remembr im he...",NaN,NaN,NaN
4100,spam,GSOH? Good with SPAM the ladies?U could b a ma...,NaN,NaN,NaN
1515,ham,I wonder if you'll get this text?,NaN,NaN,NaN
3722,ham,We left already we at orchard now.,NaN,NaN,NaN

In [33]:
mp.shape

(5572, 5)

In [34]:
# steps we follow in completing the project are:
# 1) data cleaning (because in this data set we have much nan values are present)
# 2) EDA (exploratory data analysis)
# 3) text prepocessing 
# 4) model buliding 
# 5) evaluation 
# 6) improvement 
# 7) forming website and deploy on website

In [35]:
mp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [36]:
mp.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'],inplace=True) #this permanent function so we do inplace =true
#we use inplace =true isto avoid creating a new DataFrame object with each successive modification but instead making changes to the original DataFrame itself

In [37]:
mp.sample(5)

        v1                                                 v2
3943   ham   Until 545 lor... Ya, can go 4 dinner together...
4871   ham  Hi dis is yijue i would be happy to work wif Ì...
2359  spam  Spook up your mob with a Halloween collection ...
5465   ham  Shall I bring us a bottle of wine to keep us a...
1626   ham                          Dear how you. Are you ok?

In [38]:
mp.rename(columns={'v1':'target','v2':'message'},inplace=True)

In [39]:
mp.sample(5)

     target                                            message
4102   spam  U have a secret admirer who is looking 2 make ...
2922    ham                            Fine am simply sitting.
1744   spam  Someone has conacted our dating service and en...
2266   spam  <Forwarded from 88877>FREE entry into our å£25...
2843    ham  Today iZ Yellow rose day. If u love my frndshi...

In [40]:
from sklearn.preprocessing import LabelEncoder 
encoder = LabelEncoder()

In [42]:
mp['target']=encoder.fit_transform(mp['target'])

In [43]:
mp.head()

   target                                            message
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [44]:
#checking how many missing values are present in this dataset 
mp.isnull().sum()

target     0
message    0
dtype: int64

In [45]:
#cheaking for duplicate values
mp.duplicated().sum()

403

In [46]:
#after removing duplicates
mp=mp.drop_duplicates(keep='first')
#checking after removing how many duplicate values are present 
mp.duplicated().sum()

0

In [48]:
#after removing duplicate values about remaining dataset 
mp.shape

(5169, 2)

In [52]:
#here our cleaning part is completed now our task is to do eda
mp['target'].value_counts()

0    4516
1     653
Name: target, dtype: int64